#include "cat_assets.h"
#include<stdio.h>

const char *happy_face[]={
    "(˶•̀֊•́)",

    "૮₍ˊᗜˋ₎ა",

    "ෆ( ˶'ᵕ'˶)ෆ ",

    "(｡•̀ᴗ-)✧",

    "ヾ(๑╹ヮ╹๑)ﾉ”",

    "(ง •̀_•́)ง",

    NULL
};

const char *depress_face[]={
    "<(｀^´)>",

    "´ᯅ`",

    "( ¬_¬ )",

    "୧(๑•̀ᗝ•́)૭",
    
    "ヽ( `д´ )ノ",

    NULL
};

const char *lonely_face[]={
    "( •-• )",

    "( . . )",

    "(´-ω-`)",

    "(-_-) zzZ",   

    NULL
};

const char *done_lines[]={
    "好棒哇！简直是超人！",

    "Done! 给自己倒杯咖啡庆祝下吧。",

    "这种效率...好厉害！",

    "搞定啦？这么快！",

    "不错嘛。快去休息会儿！",

    "好厉害！不过也不要逼自己太紧啦。",

    "接下来做什么呢？",

    NULL
};

const char *add_lines[] = {
    "记下来啦！别忘了完成喔！",

    "清单又变长了，加油哇！",

    "已严肃记录！",

    "这就是今天的头等大事吗？",

    "好喔，我要监督你执行了！",

    "喜欢看到你有干劲的样子。",

    NULL
};


const char *open_lines[] = {
    "让我看看... 还有哪些事情没做呢？",
    
    "欢迎回来！",

    "又是忙碌的一天吗？来看看清单吧。",

    "还没清空吗？我会一直盯着你直到完成！",

    "看到不要有紧迫感喔...",

    "记得做呀！光说不练可不行。",

    "嘿嘿，你来啦！",

    NULL
};

const char *incorrect_lines[] = {
    "你在输入什么乱七八糟的...",

    "是不是点错了？再试试。",

    "又是这种低级错误，笨蛋！",

    "哎呀简直是世界上最猪的一只！",

    NULL
};

const char *undone_lines[]={
    "这个任务这么久了，你真的有在看吗？",

    "别看我，去看你的代码和磁盘！",

    "少玩一会，动起来啊！",

    "看你敲键盘这么响，怎么 TODO 还是一个没少？",

    "你是打算把这些任务留着当传家宝吗？快动起来！",

    "还在忙别的？有在做任务吗？理理我呀！",

    "别装作很忙的样子，我都看到你还没完成今天的任务了！",

    "Miss u...",

    "还在摸鱼？（盯--）",

    "任务堆积中...请及时清理你的缓冲区！",

    "快来看看任务呀！",

    "既然在做事情，要不顺手把这个任务做了？",

    "现在的你：摸鱼中（好吧应该也在做事情）。清单里的你：装死中。",

    "（敲敲屏幕）喂，别忘了你的内存里还挂着这几个未完成的进程！",

    NULL
};