#include "cat_assets.h"
#include<stdio.h>

const char *happy_face[]={
    "(˶•̀֊•́)",

    "૮₍ˊᗜˋ₎ა",

    "ෆ( ˶'ᵕ'˶)ෆ ",

    "(｡•̀ᴗ-)✧",

    "ヾ(๑╹ヮ╹๑)ﾉ”",

    "(ง •̀_•́)ง",

    "(≧◡≦) ♡",

    "(๑>◡<๑)",

    "٩(ˊᗜˋ*)و",

    "(づ｡◕‿‿◕｡)づ",

    NULL
};

const char *depress_face[]={
    "<(｀^´)>",

    "´ᯅ`",

    "( ¬_¬ )",

    "୧(๑•̀ᗝ•́)૭",

    "ヽ( `д´ )ノ",

    "(；一_一)",

    "(￣︿￣)",

    "(T_T)",

    "(╥﹏╥)",

    NULL
};

const char *lonely_face[]={
    "( •-• )",

    "( . . )",

    "(´-ω-`)",

    "(-_-) zzZ",

    "(._.)",

    "(´･_･`)",

    "( ´･･)ﾉ(._.`)",

    "(；ω；)",

    "(っ´ω`)ﾉ(╥ω╥)",

    NULL
};


const char *done_lines[]={
    "好棒哇！简直是超人！",

    "Done! 给自己倒杯咖啡庆祝下吧。",

    "这种效率...好厉害！",

    "搞定啦？这么快！",

    "不错嘛。快去休息会儿！",

    "好厉害！不过也不要逼自己太紧啦。",

    "接下来做什么呢？",

    "你真的越来越靠谱了欸。",

    "辛苦辛苦，值得夸夸。",

    "今天你效率高得离谱。",

    "嘿嘿，又解决一个！",

    NULL
};

const char *add_lines[] = {
    "记下来啦！别忘了完成喔！",

    "清单又变长了，加油哇！",

    "已严肃记录！",

    "这就是今天的头等大事吗？",

    "好喔，我要监督你执行了！",

    "喜欢看到你有干劲的样子。",

    "记住啦，之后可不许装忘记。",

    "好耶，又有事情做啦（？）",

    "这个看起来很重要。",

    NULL
};


const char *open_lines[] = {
    "让我看看... 还有哪些事情没做呢？",
    
    "欢迎回来！",

    "又是忙碌的一天吗？来看看清单吧。",

    "还没清空吗？我会一直盯着你直到完成！",

    "看到不要有紧迫感喔...",

    "记得做呀！光说不练可不行。",

    "嘿嘿，你来啦！",

    "来吧，一点点来！",

    "今天也要认真一点哦。",

    "有没有一种任务越看越多的感觉？",

    "你终于来看任务啦。",

    "让我看看你的进度...",

    NULL
};

const char *incorrect_lines[] = {
    "你在输入什么乱七八糟的...",

    "是不是点错了？再试试。",

    "又是这种低级错误，笨蛋！",

    "哎呀简直是世界上最猪的一只！",

    "命令解析有点问题...",

    "你是不是在乱按键盘？",

    "参数不太对劲欸。",

    "诶？发生什么事了？",

    "我的脑袋理解不了这个输入。",

    NULL
};

const char *undone_lines[]={
    "这个任务这么久了，你真的有在看吗？",

    "别看我，去看你的代码和磁盘！",

    "少玩一会，动起来啊！",

    "看你敲键盘这么响，怎么 TODO 还是一个没少？",

    "你是打算把这些任务留着当传家宝吗？快动起来！",

    "还在忙别的？有在做任务吗？理理我呀！",

    "别装作很忙的样子，我都看到你还没完成今天的任务了！",

    "Miss u...",

    "还在摸鱼？（盯--）",

    "任务堆积中...请及时清理你的缓冲区！",

    "快来看看任务呀！",

    "既然在做事情，要不顺手把这个任务做了？",

    "现在的你：摸鱼中（好吧应该也在做事情）。清单里的你：装死中。",

    "（敲敲屏幕）喂，别忘了你的内存里还挂着这几个未完成的进程！",

    "任务正在偷偷长蘑菇...",

    "摸鱼结束了吗？结束了就开工吧。",

    "在干嘛呢？",

    NULL
};

const char *morning_lines[] = {
    "早安呀！这么早就开始工作啦",

    "清晨适合开始新任务！",

    "新的一天启动成功！",

    "嘿嘿，今天也会是很棒的一天。",

    "早哇！先把最麻烦的事情解决掉叭。",

    "早餐吃了吗？别空着肚子写代码哇！",

    "今天的任务正在被消灭！（跑步）",

    "咖啡、键盘、任务列表！",

    "昨晚休息得怎么样？",

    "居然没有赖床！",

    "今天也在好好学习啦！",

    "欸？居然这么早就开始做事了，好认真喔！",

    NULL
};

const char *night_lines[] = {
    "凌晨了欸……还不睡吗？",

    "夜深了，要好好休息哇。",

    "辛苦啦。",

    "现在陪着你的只有屏幕和我了。",

    "别熬太晚呀，对自己的身体太差了！",

    "已经是第二天了喔。",

    "这个点了，（嚼嚼嚼）要不要吃点东西？（嚼嚼嚼）",

    "要不要先去睡一会儿？不许再学了！",

    "凌晨效率更高么？",

    "困了吗？",

    "晚安...快去睡觉！",

    "还有多少呀？",

    "别硬撑啦，休息也是任务的一部分。",

    "这个时间还在工作的人，都很厉害。",

    "再坚持一下么？",

    "记得保存文件再去睡觉！",

    NULL
};